package com.AtGuiGu.Day12_Interface;

/**
 *
 * 接口的使用
 * 1.接口使用interface来定义
 * 2.Java中，接口和类是并列的两个结构
 * 3.如何定义接口：定义接口中的成员
 *
 * 		3.1 JDK7及以前：只能定义全局常量和抽象方法
 * 			>全局常量：public static final的.但是书写时，可以省略不写
 * 			>抽象方法：public abstract的
 *
 * 		3.2 JDK8：除了定义全局常量和抽象方法之外，还可以定义
 * 	        	静态方法、通过接口直接调用 实现类无法调用
 * 	        	默认方法（略）实现类调用,可以重写
 * 	     子类继承了父类和实现的接口中生了同名同参数的方法,子类未重写,调用的是父类的方法(类优先原则)
 * 	     子类实现了多个接口,而多个接口中定义了同名同参数的默认方法. 实现类没有重写, 保存, 接口冲突, 需要重写
 * 	     在子类的调用接口的默认方法
 * 	     接口名.super.接口的默认方法
 *
 *
 * 4. 接口中不能定义构造器的！意味着接口不可以实例化
 *
 * 5. Java开发中，接口通过让类去实现(implements)的方式来使用.
 *    如果实现类覆盖了接口中的所有抽象方法，则此实现类就可以实例化
 *    如果实现类没有覆盖接口中所有的抽象方法，则此实现类仍为一个抽象类
 *
 * 6. Java类可以实现多个接口   --->弥补了Java单继承性的局限性
 *   格式：class AA extends BB implements CC,DD,EE
 *
 * 7. 接口与接口之间可以继承，而且可以多继承
 *
 * *******************************
 * 8. 接口的具体使用，体现多态性
 * 9. 接口，实际上可以看做是一种规范
 *
 * 面试题：抽象类与接口有哪些异同？
 *
 *
 * @author Chaoqun Cheng
 * @date 2021-04-2021/4/22-9:54
 */

public class TestInterface {
}
