package com.AtGuiGu.Day11_Abstract;

/**
 *
 * abstract关键字的使用
 * 1.abstract:抽象的
 * 2.abstract可以用来修饰的结构：类、方法
 *
 * 3. abstract修饰类：抽象类
 * 		> 此类不能实例化
 *      > 抽象类中一定有构造器，便于子类实例化时调用（涉及：子类对象实例化的全过程）
 *      > 开发中，都会提供抽象类的子类，让子类对象实例化，完成相关的操作
 *
 *
 * 4. abstract修饰方法：抽象方法
 * 		> 抽象方法只有方法的声明，没有方法体
 * 		> 包含抽象方法的类，一定是一个抽象类。反之，抽象类中可以没有抽象方法的。
 *      > 若子类重写了父类中的所有的抽象方法后，此子类方可实例化
 *        若子类没有重写父类中的所有的抽象方法，则此子类也是一个抽象类，需要使用abstract修饰
 *
 *  abstract使用上的注意点：
 *  1.abstract不能用来修饰：属性、构造器等结构
 *
 *  2.abstract不能用来修饰私有方法(私有不能重写,但是抽象方法必须被子类重写)、静态方法(static修饰的方法不能被重写)、final的方法、final的类
 *
 *
 *
 * @author Chaoqun Cheng
 * @date 2021-04-2021/4/22-9:42
 */

public class TestAbstract {
}
